v2206/MSc_icedAirfoil/smooth_benchmark/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver		    GAMG;
        smoother        GaussSeidel;
        tolerance       1e-08;
        relTol          1e-04;
    }
    pFinal
    {
	    $p;
    }

    "(U|k|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-08;
        relTol          1e-04;
	    nSweeps		    1;
    }
    "(U|k|omega)Final"
    {
	    $U;	
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors	0;
    correctPhi                  yes;
    nOuterCorrectors            2;
    nCorrectors                 1;
    pRefCell		            0;
    pRefValue		            0;
}

SIMPLE
{
    nNonOrthogonalCorrectors	0;
    consistent		            yes;
    pRefCell		            0;
    pRefValue		            0;
}

relaxationFactors
{
    equations
    {
        "(U|k|omega)"	0.95;
        ".*"            0.95;
    }
}

// ************************************************************************* //
